<b> Pandas Basics <b>

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.1.3'

In [3]:
np.__version__

'1.19.2'

In [4]:
dict = { "one" : [1,2,3,4]}

In [5]:
type(dict)

dict

In [6]:
my_series = pd.Series(dict)

In [7]:
type(my_series)

pandas.core.series.Series

In [9]:
my_series

one    [1, 2, 3, 4]
dtype: object

In [8]:
a1 = np.random.randint(5,size=10)

In [10]:
a1

array([2, 3, 1, 3, 4, 0, 1, 2, 4, 0])

In [11]:
series1 = pd.Series(a1)

In [12]:
type(series1)

pandas.core.series.Series

In [13]:
series1

0    2
1    3
2    1
3    3
4    4
5    0
6    1
7    2
8    4
9    0
dtype: int32

<b> Data frame <b>

In [14]:
dict = {
    "id" : [1,2,3,5], "name" : ["a","b","c","d"]
}
dict

{'id': [1, 2, 3, 5], 'name': ['a', 'b', 'c', 'd']}

In [15]:
type(dict)

dict

In [16]:
df = pd.DataFrame(dict)

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df

   id name
0   1    a
1   2    b
2   3    c
3   5    d

In [19]:
df.columns

Index(['id', 'name'], dtype='object')

In [20]:
df.dtypes

id       int64
name    object
dtype: object

<b> Reading files using Pandas <b>

In [21]:
df = pd.read_csv("students.csv")

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [25]:
df_excel = pd.read_excel("students.xlsx")

In [26]:
df_excel

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [27]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [28]:
df.to_excel("mynewexportedfile.xlsx")

<b> Data Selection <b>

In [29]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [30]:
df.name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [31]:
list_of_columns = ["id", "name", "compre"]
extracted = df[list_of_columns]

In [32]:
type(extracted)

pandas.core.frame.DataFrame

In [33]:
extracted

   id    name  compre
0   1  pravin      34
1   2   patil       4
2   3    john      33
3   4   sadiq      11
4   5  pravin      34

In [34]:
df.name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [35]:
df["name"]

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [36]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [37]:
df.iloc[0,0]

1

In [38]:
df.iloc[0,1]

'pravin'

In [39]:
df.loc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [40]:
df.loc[0,"name"]

'pravin'

In [41]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [42]:
df[df.quiz1 > 3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [43]:
df["quiz1"]

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [44]:
df[(df.quiz1 > 3) & (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [45]:
df[(df.quiz1 > 3) | (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [46]:
df.query("quiz1 > 3")

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [47]:
df.loc[2]

id               3
name          john
quiz1            3
quiz2            3
assignment       5
midsem          11
compre          33
Name: 2, dtype: object